app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", ""], ["created_at", "2016-05-04 03:57:38.719240"], ["updated_at", "2016-05-04 03:57:38.719240"]]