app/controllers/tags_controller.rb

  def destroy
    @tag = Tag.find(params[:id])

    flash.notice = "Tag '#{@tag}' Deleted!"

    @tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 4]]